Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_IOMUXC_GPR.h
#define IOMUXC_GPR_GPR73_LPUART12_IPG_STOP_MODE_MASK (0x800000U)
#define IOMUXC_GPR_GPR73_LPUART12_IPG_STOP_MODE_SHIFT (23U)
/*! LPUART12_IPG_STOP_MODE - LPUART12 stop mode selection, cannot change when LPUART12_STOP_REQ is asserted.
 *  0b0..This module is functional in Stop Mode
 *  0b1..This module is not functional in Stop Mode and the corresponding x_STOP_REQ field is set to '1'.
 */
#define IOMUXC_GPR_GPR73_LPUART12_IPG_STOP_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR73_LPUART12_IPG_STOP_MODE_SHIFT)) & IOMUXC_GPR_GPR73_LPUART12_IPG_STOP_MODE_MASK)

#define IOMUXC_GPR_GPR73_MIC_IPG_DOZE_MASK       (0x1000000U)
#define IOMUXC_GPR_GPR73_MIC_IPG_DOZE_SHIFT      (24U)
/*! MIC_IPG_DOZE - MIC doze mode */
#define IOMUXC_GPR_GPR73_MIC_IPG_DOZE(x)         (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR73_MIC_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR73_MIC_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR73_MIC_STOP_REQ_MASK       (0x2000000U)
#define IOMUXC_GPR_GPR73_MIC_STOP_REQ_SHIFT      (25U)
/*! MIC_STOP_REQ - MIC stop request */
#define IOMUXC_GPR_GPR73_MIC_STOP_REQ(x)         (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR73_MIC_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR73_MIC_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR73_MIC_IPG_STOP_MODE_MASK  (0x4000000U)
#define IOMUXC_GPR_GPR73_MIC_IPG_STOP_MODE_SHIFT (26U)
/*! MIC_IPG_STOP_MODE - MIC stop mode selection, cannot change when MIC_STOP_REQ is asserted.
 *  0b0..This module is functional in Stop Mode
 *  0b1..This module is not functional in Stop Mode and the corresponding x_STOP_REQ field is set to '1'.
 */
#define IOMUXC_GPR_GPR73_MIC_IPG_STOP_MODE(x)    (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR73_MIC_IPG_STOP_MODE_SHIFT)) & IOMUXC_GPR_GPR73_MIC_IPG_STOP_MODE_MASK)

#define IOMUXC_GPR_GPR73_DWP_MASK                (0x30000000U)
#define IOMUXC_GPR_GPR73_DWP_SHIFT               (28U)
/*! DWP - Domain write protection
 *  0b00..Both cores are allowed
 *  0b01..CM7 is forbidden
 *  0b10..CM4 is forbidden
 *  0b11..Both cores are forbidden
 */
#define IOMUXC_GPR_GPR73_DWP(x)                  (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR73_DWP_SHIFT)) & IOMUXC_GPR_GPR73_DWP_MASK)

#define IOMUXC_GPR_GPR73_DWP_LOCK_MASK           (0xC0000000U)
#define IOMUXC_GPR_GPR73_DWP_LOCK_SHIFT          (30U)
/*! DWP_LOCK - Domain write protection lock
 *  0b00..Neither of DWP bits is locked
 *  0b01..The lower DWP bit is locked
 *  0b10..The higher DWP bit is locked
 *  0b11..Both DWP bits are locked
 */
#define IOMUXC_GPR_GPR73_DWP_LOCK(x)             (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR73_DWP_LOCK_SHIFT)) & IOMUXC_GPR_GPR73_DWP_LOCK_MASK)
/*! @} */

/*! @name GPR74 - GPR74 General Purpose Register */
/*! @{ */

#define IOMUXC_GPR_GPR74_PIT1_STOP_REQ_MASK      (0x2U)
#define IOMUXC_GPR_GPR74_PIT1_STOP_REQ_SHIFT     (1U)
/*! PIT1_STOP_REQ - PIT1 stop request */
#define IOMUXC_GPR_GPR74_PIT1_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_PIT1_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR74_PIT1_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR74_PIT2_STOP_REQ_MASK      (0x4U)
#define IOMUXC_GPR_GPR74_PIT2_STOP_REQ_SHIFT     (2U)
/*! PIT2_STOP_REQ - PIT2 stop request */
#define IOMUXC_GPR_GPR74_PIT2_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_PIT2_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR74_PIT2_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR74_SEMC_STOP_REQ_MASK      (0x8U)
#define IOMUXC_GPR_GPR74_SEMC_STOP_REQ_SHIFT     (3U)
/*! SEMC_STOP_REQ - SEMC stop request */
#define IOMUXC_GPR_GPR74_SEMC_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_SEMC_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR74_SEMC_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR74_SIM1_IPG_DOZE_MASK      (0x10U)
#define IOMUXC_GPR_GPR74_SIM1_IPG_DOZE_SHIFT     (4U)
/*! SIM1_IPG_DOZE - SIM1 doze mode */
#define IOMUXC_GPR_GPR74_SIM1_IPG_DOZE(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_SIM1_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR74_SIM1_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR74_SIM2_IPG_DOZE_MASK      (0x20U)
#define IOMUXC_GPR_GPR74_SIM2_IPG_DOZE_SHIFT     (5U)
/*! SIM2_IPG_DOZE - SIM2 doze mode */
#define IOMUXC_GPR_GPR74_SIM2_IPG_DOZE(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_SIM2_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR74_SIM2_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR74_SNVS_HP_IPG_DOZE_MASK   (0x40U)
#define IOMUXC_GPR_GPR74_SNVS_HP_IPG_DOZE_SHIFT  (6U)
/*! SNVS_HP_IPG_DOZE - SNVS_HP doze mode */
#define IOMUXC_GPR_GPR74_SNVS_HP_IPG_DOZE(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_SNVS_HP_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR74_SNVS_HP_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR74_SNVS_HP_STOP_REQ_MASK   (0x80U)
#define IOMUXC_GPR_GPR74_SNVS_HP_STOP_REQ_SHIFT  (7U)
/*! SNVS_HP_STOP_REQ - SNVS_HP stop request */
#define IOMUXC_GPR_GPR74_SNVS_HP_STOP_REQ(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_SNVS_HP_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR74_SNVS_HP_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR74_WDOG1_IPG_DOZE_MASK     (0x100U)
#define IOMUXC_GPR_GPR74_WDOG1_IPG_DOZE_SHIFT    (8U)
/*! WDOG1_IPG_DOZE - WDOG1 doze mode */
#define IOMUXC_GPR_GPR74_WDOG1_IPG_DOZE(x)       (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_WDOG1_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR74_WDOG1_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR74_WDOG2_IPG_DOZE_MASK     (0x200U)
#define IOMUXC_GPR_GPR74_WDOG2_IPG_DOZE_SHIFT    (9U)
/*! WDOG2_IPG_DOZE - WDOG2 doze mode */
#define IOMUXC_GPR_GPR74_WDOG2_IPG_DOZE(x)       (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_WDOG2_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR74_WDOG2_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR74_SAI1_STOP_REQ_MASK      (0x400U)
#define IOMUXC_GPR_GPR74_SAI1_STOP_REQ_SHIFT     (10U)
/*! SAI1_STOP_REQ - SAI1 stop request */
#define IOMUXC_GPR_GPR74_SAI1_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_SAI1_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR74_SAI1_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR74_SAI2_STOP_REQ_MASK      (0x800U)
#define IOMUXC_GPR_GPR74_SAI2_STOP_REQ_SHIFT     (11U)
/*! SAI2_STOP_REQ - SAI2 stop request */
#define IOMUXC_GPR_GPR74_SAI2_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_SAI2_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR74_SAI2_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR74_SAI3_STOP_REQ_MASK      (0x1000U)
#define IOMUXC_GPR_GPR74_SAI3_STOP_REQ_SHIFT     (12U)
/*! SAI3_STOP_REQ - SAI3 stop request */
#define IOMUXC_GPR_GPR74_SAI3_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_SAI3_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR74_SAI3_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR74_SAI4_STOP_REQ_MASK      (0x2000U)
#define IOMUXC_GPR_GPR74_SAI4_STOP_REQ_SHIFT     (13U)
/*! SAI4_STOP_REQ - SAI4 stop request */
#define IOMUXC_GPR_GPR74_SAI4_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_SAI4_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR74_SAI4_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR74_FLEXIO1_STOP_REQ_BUS_MASK (0x4000U)
#define IOMUXC_GPR_GPR74_FLEXIO1_STOP_REQ_BUS_SHIFT (14U)
/*! FLEXIO1_STOP_REQ_BUS - FLEXIO1 bus clock domain stop request */
#define IOMUXC_GPR_GPR74_FLEXIO1_STOP_REQ_BUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_FLEXIO1_STOP_REQ_BUS_SHIFT)) & IOMUXC_GPR_GPR74_FLEXIO1_STOP_REQ_BUS_MASK)

#define IOMUXC_GPR_GPR74_FLEXIO1_STOP_REQ_PER_MASK (0x8000U)
#define IOMUXC_GPR_GPR74_FLEXIO1_STOP_REQ_PER_SHIFT (15U)
/*! FLEXIO1_STOP_REQ_PER - FLEXIO1 peripheral clock domain stop request */
#define IOMUXC_GPR_GPR74_FLEXIO1_STOP_REQ_PER(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_FLEXIO1_STOP_REQ_PER_SHIFT)) & IOMUXC_GPR_GPR74_FLEXIO1_STOP_REQ_PER_MASK)

#define IOMUXC_GPR_GPR74_FLEXIO2_STOP_REQ_BUS_MASK (0x10000U)
#define IOMUXC_GPR_GPR74_FLEXIO2_STOP_REQ_BUS_SHIFT (16U)
/*! FLEXIO2_STOP_REQ_BUS - FLEXIO2 bus clock domain stop request */
#define IOMUXC_GPR_GPR74_FLEXIO2_STOP_REQ_BUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_FLEXIO2_STOP_REQ_BUS_SHIFT)) & IOMUXC_GPR_GPR74_FLEXIO2_STOP_REQ_BUS_MASK)

#define IOMUXC_GPR_GPR74_FLEXIO2_STOP_REQ_PER_MASK (0x20000U)
#define IOMUXC_GPR_GPR74_FLEXIO2_STOP_REQ_PER_SHIFT (17U)
/*! FLEXIO2_STOP_REQ_PER - FLEXIO2 peripheral clock domain stop request */
#define IOMUXC_GPR_GPR74_FLEXIO2_STOP_REQ_PER(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_FLEXIO2_STOP_REQ_PER_SHIFT)) & IOMUXC_GPR_GPR74_FLEXIO2_STOP_REQ_PER_MASK)

