Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_IOMUXC_GPR.h
#define IOMUXC_GPR_GPR75_LPSPI1_STOP_ACK_MASK    (0x40000U)
#define IOMUXC_GPR_GPR75_LPSPI1_STOP_ACK_SHIFT   (18U)
/*! LPSPI1_STOP_ACK - LPSPI1 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPSPI1_STOP_ACK(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPSPI1_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPSPI1_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPSPI2_STOP_ACK_MASK    (0x80000U)
#define IOMUXC_GPR_GPR75_LPSPI2_STOP_ACK_SHIFT   (19U)
/*! LPSPI2_STOP_ACK - LPSPI2 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPSPI2_STOP_ACK(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPSPI2_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPSPI2_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPSPI3_STOP_ACK_MASK    (0x100000U)
#define IOMUXC_GPR_GPR75_LPSPI3_STOP_ACK_SHIFT   (20U)
/*! LPSPI3_STOP_ACK - LPSPI3 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPSPI3_STOP_ACK(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPSPI3_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPSPI3_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPSPI4_STOP_ACK_MASK    (0x200000U)
#define IOMUXC_GPR_GPR75_LPSPI4_STOP_ACK_SHIFT   (21U)
/*! LPSPI4_STOP_ACK - LPSPI4 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPSPI4_STOP_ACK(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPSPI4_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPSPI4_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPSPI5_STOP_ACK_MASK    (0x400000U)
#define IOMUXC_GPR_GPR75_LPSPI5_STOP_ACK_SHIFT   (22U)
/*! LPSPI5_STOP_ACK - LPSPI5 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPSPI5_STOP_ACK(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPSPI5_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPSPI5_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPSPI6_STOP_ACK_MASK    (0x800000U)
#define IOMUXC_GPR_GPR75_LPSPI6_STOP_ACK_SHIFT   (23U)
/*! LPSPI6_STOP_ACK - LPSPI6 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPSPI6_STOP_ACK(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPSPI6_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPSPI6_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPUART1_STOP_ACK_MASK   (0x1000000U)
#define IOMUXC_GPR_GPR75_LPUART1_STOP_ACK_SHIFT  (24U)
/*! LPUART1_STOP_ACK - LPUART1 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPUART1_STOP_ACK(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPUART1_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPUART1_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPUART2_STOP_ACK_MASK   (0x2000000U)
#define IOMUXC_GPR_GPR75_LPUART2_STOP_ACK_SHIFT  (25U)
/*! LPUART2_STOP_ACK - LPUART2 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPUART2_STOP_ACK(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPUART2_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPUART2_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPUART3_STOP_ACK_MASK   (0x4000000U)
#define IOMUXC_GPR_GPR75_LPUART3_STOP_ACK_SHIFT  (26U)
/*! LPUART3_STOP_ACK - LPUART3 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPUART3_STOP_ACK(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPUART3_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPUART3_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPUART4_STOP_ACK_MASK   (0x8000000U)
#define IOMUXC_GPR_GPR75_LPUART4_STOP_ACK_SHIFT  (27U)
/*! LPUART4_STOP_ACK - LPUART4 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPUART4_STOP_ACK(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPUART4_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPUART4_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPUART5_STOP_ACK_MASK   (0x10000000U)
#define IOMUXC_GPR_GPR75_LPUART5_STOP_ACK_SHIFT  (28U)
/*! LPUART5_STOP_ACK - LPUART5 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPUART5_STOP_ACK(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPUART5_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPUART5_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPUART6_STOP_ACK_MASK   (0x20000000U)
#define IOMUXC_GPR_GPR75_LPUART6_STOP_ACK_SHIFT  (29U)
/*! LPUART6_STOP_ACK - LPUART6 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPUART6_STOP_ACK(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPUART6_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPUART6_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPUART7_STOP_ACK_MASK   (0x40000000U)
#define IOMUXC_GPR_GPR75_LPUART7_STOP_ACK_SHIFT  (30U)
/*! LPUART7_STOP_ACK - LPUART7 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPUART7_STOP_ACK(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPUART7_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPUART7_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPUART8_STOP_ACK_MASK   (0x80000000U)
#define IOMUXC_GPR_GPR75_LPUART8_STOP_ACK_SHIFT  (31U)
/*! LPUART8_STOP_ACK - LPUART8 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPUART8_STOP_ACK(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPUART8_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPUART8_STOP_ACK_MASK)
/*! @} */

/*! @name GPR76 - GPR76 General Purpose Register */
/*! @{ */

#define IOMUXC_GPR_GPR76_LPUART9_STOP_ACK_MASK   (0x1U)
#define IOMUXC_GPR_GPR76_LPUART9_STOP_ACK_SHIFT  (0U)
/*! LPUART9_STOP_ACK - LPUART9 stop acknowledge */
#define IOMUXC_GPR_GPR76_LPUART9_STOP_ACK(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR76_LPUART9_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR76_LPUART9_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR76_LPUART10_STOP_ACK_MASK  (0x2U)
#define IOMUXC_GPR_GPR76_LPUART10_STOP_ACK_SHIFT (1U)
/*! LPUART10_STOP_ACK - LPUART10 stop acknowledge */
#define IOMUXC_GPR_GPR76_LPUART10_STOP_ACK(x)    (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR76_LPUART10_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR76_LPUART10_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR76_LPUART11_STOP_ACK_MASK  (0x4U)
#define IOMUXC_GPR_GPR76_LPUART11_STOP_ACK_SHIFT (2U)
/*! LPUART11_STOP_ACK - LPUART11 stop acknowledge */
#define IOMUXC_GPR_GPR76_LPUART11_STOP_ACK(x)    (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR76_LPUART11_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR76_LPUART11_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR76_LPUART12_STOP_ACK_MASK  (0x8U)
#define IOMUXC_GPR_GPR76_LPUART12_STOP_ACK_SHIFT (3U)
/*! LPUART12_STOP_ACK - LPUART12 stop acknowledge */
#define IOMUXC_GPR_GPR76_LPUART12_STOP_ACK(x)    (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR76_LPUART12_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR76_LPUART12_STOP_ACK_MASK)

